{
  "phase": 3,
  "sprint": 3,
  "title": "Multiple Tabs/Documents",
  "priority": "MEDIUM",
  "effort": "2 hours",
  "status": "planned",
  "startedAt": null,
  "completedAt": null,
  "implementationNotes": null,
  "impact": "Enables users to work with multiple DOT documents simultaneously in a tabbed interface, with independent state per tab",
  "targetMetrics": {
    "tabs": {
      "current": "Single document; opening a new file replaces current content",
      "target": "Tabbed interface with independent state, dirty tracking, and keyboard navigation"
    }
  },
  "architectureNotes": {
    "currentState": "All document state (currentFilePath, isDocumentDirty, lastCommittedDoc, lastSavedAt) lives as closure variables in bootstrap(). A single CodeMirror EditorView instance is created. Toolbar actions receive callbacks that reference this single-document state. Autosave stores one draft with flat keys (draftContent, draftTimestamp, draftFilePath).",
    "targetState": "A TabManager holds a Map of TabState objects. Each tab owns its own EditorView, file path, dirty state, committed doc, and save timestamp. Only the active tab's editor is visible (others are display:none). The toolbar callbacks delegate to the active tab via TabManager. Autosave stores drafts keyed by tab ID. Preview always renders the active tab's content.",
    "keyDecisions": [
      "Each tab gets its own CodeMirror EditorView instance (hidden when inactive, not destroyed) to preserve undo history and scroll position",
      "Layout engine selector remains global (not per-tab) since it's a rendering preference, not document state",
      "Preview zoom remains global; editor zoom is per-tab",
      "Autosave stores all tab drafts under a single 'tabDrafts' store key as a serialized object",
      "Recovery restores all tabs from the serialized drafts object",
      "Opening a file always creates a new tab (no shouldReplace prompt); Ctrl+N creates a blank tab",
      "Max 10 tabs to prevent resource issues"
    ]
  },
  "tasks": [
    {
      "id": "3.3.1",
      "category": "core",
      "title": "Create TabState interface and TabManager",
      "description": "Create src/tabs/manager.ts with the core tab management logic. Define TabState interface holding per-tab state: id, filePath, isDirty, lastCommittedDoc, lastSavedAt, editorView, editorZoomLevel. Create TabManager class with methods: createTab, closeTab, getActiveTab, setActiveTab, getTab, getAllTabs, getTabCount. TabManager emits no events; it's a pure state container that returns the new state for callers to act on. Max 10 tabs enforced. Tab IDs are auto-incrementing integers prefixed with 'tab-'.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.25,
      "files": ["src/tabs/manager.ts"],
      "testCategories": ["typecheck", "unit"],
      "acceptanceCriteria": [
        "Exports TabState interface with id, filePath, isDirty, lastCommittedDoc, lastSavedAt, editorView, editorZoomLevel fields",
        "Exports TabManager class with createTab, closeTab, getActiveTab, setActiveTab, getTab, getAllTabs, getTabCount methods",
        "createTab returns new TabState with unique ID and provided initial content",
        "closeTab removes tab from internal Map and returns the new active tab (or null if last tab)",
        "setActiveTab switches activeTabId and returns the TabState",
        "Enforces max 10 tabs (createTab returns null if at limit)",
        "pnpm typecheck passes"
      ]
    },
    {
      "id": "3.3.2",
      "category": "core",
      "title": "Create tab-bar UI component",
      "description": "Create src/tabs/tab-bar.ts with DOM rendering for the tab bar. Renders tab buttons from TabManager state. Each tab button shows: filename (or 'Untitled'), dirty indicator dot, close button (x). Active tab gets aria-selected and visual highlight. Provides setupTabBar(options) that wires click handlers for tab switching and close. Close on dirty tab calls a shouldClose callback. Add tab bar HTML container to index.html above the workspace. Add a '+' button at the end of the tab row for creating new tabs.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.3,
      "files": ["src/tabs/tab-bar.ts", "src/index.html"],
      "testCategories": ["typecheck", "unit"],
      "acceptanceCriteria": [
        "Exports setupTabBar(options) function",
        "Exports renderTabBar(tabs, activeTabId) function that updates DOM",
        "Tab bar renders one button per tab with filename or 'Untitled'",
        "Active tab has aria-selected='true' and 'active' CSS class",
        "Dirty tabs show a dot indicator before the filename",
        "Close button on each tab (hidden when only 1 tab remains)",
        "'+' button at end of tab row for new tab creation",
        "Click on tab calls onTabSwitch callback with tab ID",
        "Click on close calls onTabClose callback with tab ID",
        "Tab bar container added to index.html above workspace",
        "pnpm typecheck passes"
      ]
    },
    {
      "id": "3.3.3",
      "category": "ui",
      "title": "Style the tab bar",
      "description": "Add CSS styles for the tab bar in styles.css. Tab bar sits between toolbar and workspace as a horizontal strip. Tabs use the same color palette as the toolbar. Active tab has a bottom border accent. Dirty dot is a small colored circle. Close button is subtle until hovered. Tab bar scrolls horizontally if tabs overflow. '+' button styled as a minimal icon button.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.15,
      "files": ["src/styles.css"],
      "testCategories": ["manual"],
      "acceptanceCriteria": [
        "Tab bar has consistent height and sits between toolbar and workspace",
        "Active tab visually distinct (bottom border or background)",
        "Dirty indicator is a small dot (color matching unsaved state)",
        "Close button appears on hover, does not shift tab width",
        "Tab bar scrolls horizontally on overflow (no wrapping)",
        "'+' button styled consistently with toolbar icon buttons",
        "Matches existing toolbar aesthetic"
      ]
    },
    {
      "id": "3.3.4",
      "category": "core",
      "title": "Refactor main.ts bootstrap for multi-tab",
      "description": "Refactor the bootstrap() function in main.ts to use TabManager instead of closure state variables. Replace lastCommittedDoc, isDocumentDirty, lastSavedAt, currentFilePath with TabManager state. Create an initial tab with DEFAULT_SNIPPET. The single 'editor' variable becomes tabManager.getActiveTab().editorView. The editor-host div holds all tab editors; only the active one is visible (display:block vs display:none). commitDocument, handleDocChange, updateFileStatus all delegate to the active tab. setupToolbarActions callbacks delegate to active tab via TabManager. Wire up tab bar with callbacks for switching, closing, and creating tabs. On tab switch: hide old editor, show new editor, re-render preview, update file status. On tab close: confirm if dirty, remove tab, switch to adjacent tab.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.4,
      "files": ["src/main.ts"],
      "testCategories": ["typecheck", "manual"],
      "acceptanceCriteria": [
        "No more closure-level document state variables (replaced by TabManager)",
        "Initial tab created with DEFAULT_SNIPPET on startup",
        "commitDocument delegates to active tab's state",
        "handleDocChange updates active tab's dirty flag",
        "updateFileStatus reads from active tab",
        "Tab switching hides old editor, shows new editor, triggers preview render",
        "Tab closing confirms if dirty, removes tab, activates adjacent",
        "New tab button creates blank tab with DEFAULT_SNIPPET",
        "File status bar reflects active tab",
        "pnpm typecheck passes"
      ]
    },
    {
      "id": "3.3.5",
      "category": "core",
      "title": "Update toolbar actions for multi-tab",
      "description": "Update toolbar actions to work with multi-tab architecture. Open file: always opens in a new tab (remove shouldReplace from open-diagram). New diagram: creates a new tab instead of replacing current content (remove shouldReplace from new-diagram). Save: saves the active tab. Export: exports the active tab. Examples: loads example into a new tab. Update ToolbarActionsOptions interface to receive TabManager-aware callbacks. The shouldReplace pattern is no longer needed since each action uses a new tab.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.2,
      "files": ["src/toolbar/actions.ts", "src/toolbar/new-diagram.ts", "src/toolbar/open-diagram.ts"],
      "testCategories": ["typecheck", "unit"],
      "acceptanceCriteria": [
        "Open file creates a new tab with file content",
        "New diagram creates a new tab with default snippet",
        "Save saves active tab content to its file path",
        "Export exports active tab content",
        "Examples load into a new tab",
        "shouldReplace removed from new-diagram and open-diagram",
        "ToolbarActionsOptions updated for multi-tab callbacks",
        "Max tab limit enforced (shows status message if at limit)",
        "pnpm typecheck passes"
      ]
    },
    {
      "id": "3.3.6",
      "category": "core",
      "title": "Update autosave for multi-tab drafts",
      "description": "Refactor autosave to store drafts for all open tabs. Replace flat store keys (draftContent, draftTimestamp, draftFilePath) with a single 'tabDrafts' key containing a serialized object: { tabs: { [tabId]: { content, filePath, timestamp } }, activeTabId }. Update setupAutosave to iterate all tabs and save changed content. Update clearDraft to remove a specific tab's draft. Update recovery to restore all tabs from the serialized object. Single autosave interval covers all tabs (not one interval per tab).",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.2,
      "files": ["src/autosave/manager.ts", "src/autosave/recovery.ts", "src/autosave/constants.ts"],
      "testCategories": ["typecheck", "unit"],
      "acceptanceCriteria": [
        "Autosave stores all tabs under 'tabDrafts' key as serialized object",
        "saveDraft accepts tab ID and stores per-tab data",
        "clearDraft removes a specific tab's draft from the object",
        "clearAllDrafts removes the entire tabDrafts key",
        "Recovery restores all tabs from serialized object",
        "Recovery prompts once for all tabs (not per-tab)",
        "Stale draft cleanup applies to the entire drafts object",
        "Single 30s interval iterates all tabs",
        "Old flat keys (draftContent, draftTimestamp, draftFilePath) cleaned up on first run",
        "pnpm typecheck passes"
      ]
    },
    {
      "id": "3.3.7",
      "category": "core",
      "title": "Add tab keyboard shortcuts",
      "description": "Extend src/toolbar/shortcuts.ts with tab navigation shortcuts. Add Ctrl+T for new tab, Ctrl+W for close tab, Ctrl+Tab for next tab, Ctrl+Shift+Tab for previous tab. These shortcuts need TabManager callbacks passed through the options. Update the help dialog content in index.html to document the new shortcuts.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.1,
      "files": ["src/toolbar/shortcuts.ts", "src/index.html"],
      "testCategories": ["typecheck", "unit"],
      "acceptanceCriteria": [
        "Ctrl+T creates a new tab",
        "Ctrl+W closes the active tab (confirms if dirty)",
        "Ctrl+Tab switches to the next tab (wraps around)",
        "Ctrl+Shift+Tab switches to the previous tab (wraps around)",
        "Ctrl+W on last tab is no-op (cannot close last tab)",
        "Help dialog updated with tab shortcuts",
        "pnpm typecheck passes"
      ]
    },
    {
      "id": "3.3.8",
      "category": "testing",
      "title": "Add unit tests for TabManager",
      "description": "Create test/tabs/manager.test.ts with comprehensive tests for the TabManager class. Cover: tab creation, tab closing, active tab switching, max tab limit, tab state updates, edge cases (close last tab, close active tab, switch to nonexistent tab).",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.2,
      "files": ["test/tabs/manager.test.ts"],
      "testCategories": ["unit"],
      "acceptanceCriteria": [
        "Tests for createTab with default and custom content",
        "Tests for closeTab removing tab and returning new active",
        "Tests for closeTab on last tab returning null",
        "Tests for setActiveTab switching active tab",
        "Tests for setActiveTab with nonexistent ID",
        "Tests for max 10 tab enforcement",
        "Tests for getTab, getAllTabs, getTabCount",
        "Tests for tab ID uniqueness",
        "80%+ coverage"
      ]
    },
    {
      "id": "3.3.9",
      "category": "testing",
      "title": "Add unit tests for tab-bar component",
      "description": "Create test/tabs/tab-bar.test.ts with tests for the tab bar UI rendering and interaction. Cover: rendering tabs, active tab highlighting, dirty indicator, close button behavior, tab click handler, new tab button.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.15,
      "files": ["test/tabs/tab-bar.test.ts"],
      "testCategories": ["unit"],
      "acceptanceCriteria": [
        "Tests for renderTabBar rendering correct number of tabs",
        "Tests for active tab having aria-selected and active class",
        "Tests for dirty indicator dot on dirty tabs",
        "Tests for close button click calling onTabClose",
        "Tests for tab click calling onTabSwitch",
        "Tests for close button hidden when only 1 tab",
        "Tests for '+' button calling onNewTab",
        "80%+ coverage"
      ]
    },
    {
      "id": "3.3.10",
      "category": "testing",
      "title": "Update existing tests for multi-tab changes",
      "description": "Update existing toolbar tests (actions, new-diagram, open-diagram, save-diagram) and autosave tests (manager, recovery) to work with the refactored multi-tab APIs. Existing behavior should be preserved for single-tab scenarios. Add tests for multi-tab autosave serialization.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.2,
      "files": [
        "test/toolbar/actions.test.ts",
        "test/toolbar/new-diagram.test.ts",
        "test/toolbar/open-diagram.test.ts",
        "test/autosave/manager.test.ts",
        "test/autosave/recovery.test.ts"
      ],
      "testCategories": ["unit"],
      "acceptanceCriteria": [
        "Existing toolbar tests updated for new API signatures",
        "Existing autosave tests updated for serialized tab drafts",
        "New tests for multi-tab autosave (save multiple tabs, clear single tab)",
        "New tests for multi-tab recovery (restore multiple tabs)",
        "All existing test assertions still pass (no regressions)",
        "pnpm test passes with 0 failures"
      ]
    },
    {
      "id": "3.3.11",
      "category": "documentation",
      "title": "Update documentation and commit",
      "description": "Update CHANGELOG with multiple tabs feature details. Update ROADMAP to mark Multiple Tabs/Documents as completed. Update sprint JSON with implementation notes. Commit all changes.",
      "status": "planned",
      "implementationNotes": null,
      "estimatedHours": 0.1,
      "files": ["CHANGELOG.md", "docs/planning/ROADMAP.md", "docs/planning/PHASE_3_SPRINT_3_TODO.json"],
      "testCategories": ["manual"],
      "acceptanceCriteria": [
        "CHANGELOG updated with multiple tabs feature details",
        "ROADMAP shows Multiple Tabs/Documents as completed",
        "Sprint JSON updated with implementation notes",
        "All tests pass",
        "Changes committed to GitHub"
      ]
    }
  ],
  "successCriteria": [
    "Multiple tabs can be opened simultaneously (up to 10)",
    "Each tab maintains independent content, file path, dirty state, and save timestamp",
    "Tab bar displays all open tabs with filename, dirty indicator, and close button",
    "Clicking a tab switches the active editor and re-renders preview",
    "Opening a file creates a new tab",
    "New diagram creates a new tab",
    "Save/export operates on the active tab",
    "Closing a dirty tab prompts for confirmation",
    "Cannot close the last remaining tab",
    "Keyboard shortcuts: Ctrl+T (new), Ctrl+W (close), Ctrl+Tab (next), Ctrl+Shift+Tab (prev)",
    "Autosave preserves all tab drafts",
    "Recovery restores all tabs from previous session",
    "All unit tests pass with 80%+ coverage on new code",
    "No regression in existing tests"
  ],
  "filesCreated": [
    "src/tabs/manager.ts",
    "src/tabs/tab-bar.ts",
    "test/tabs/manager.test.ts",
    "test/tabs/tab-bar.test.ts"
  ],
  "filesModified": [
    "src/main.ts",
    "src/index.html",
    "src/styles.css",
    "src/toolbar/actions.ts",
    "src/toolbar/new-diagram.ts",
    "src/toolbar/open-diagram.ts",
    "src/toolbar/shortcuts.ts",
    "src/autosave/manager.ts",
    "src/autosave/recovery.ts",
    "src/autosave/constants.ts",
    "test/toolbar/actions.test.ts",
    "test/toolbar/new-diagram.test.ts",
    "test/toolbar/open-diagram.test.ts",
    "test/autosave/manager.test.ts",
    "test/autosave/recovery.test.ts",
    "CHANGELOG.md",
    "docs/planning/ROADMAP.md"
  ],
  "totalNewTests": 30,
  "totalEstimatedHours": 2.25,
  "dependencies": ["Phase 3 Sprint 2 complete", "Tauri Store plugin available"],
  "storeKeys": {
    "tabDrafts": "Serialized object: { tabs: { [tabId]: { content, filePath, timestamp } }, activeTabId }",
    "draftContent": "DEPRECATED - old flat key, cleaned up on first run",
    "draftTimestamp": "DEPRECATED - old flat key, cleaned up on first run",
    "draftFilePath": "DEPRECATED - old flat key, cleaned up on first run"
  },
  "notes": [
    "This is the largest sprint so far - a significant refactor of main.ts state management",
    "Each tab gets its own CodeMirror EditorView (hidden via display:none when inactive)",
    "Layout engine selector remains global (not per-tab)",
    "Preview zoom remains global; editor zoom is per-tab",
    "Opening a file always creates a new tab (no more shouldReplace confirmation for open)",
    "Max 10 tabs prevents resource exhaustion",
    "Tab IDs are auto-incrementing ('tab-1', 'tab-2', etc.) - not reused",
    "Old flat autosave keys are cleaned up on first run to migrate to serialized format",
    "Existing tests will need API updates but should preserve behavioral assertions"
  ]
}
